//task 1
//Задача 1js.Pm.Bs.SCh

// Дана строка 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.

let str = 'abcde'
alert(str[0]); 
alert(str[2]); 
alert(str[4]);

//task 2
//Задача 2js.Pm.Bs.SCh
// Дана переменная со строкой 'abcde'. Обращаясь к отдельным символамэтой строки запишите в новую переменную символы этой строки в обратном порядке, то есть 'edcba'.

let str = 'abcde'
alert(str[4]); 
alert(str[3]); 
alert(str[2]);
alert(str[1]); 
alert(str[0]); 


//task 3
//Задача 3js.Pm.Bs.SCh
// Дана переменная str со строкой 'abcde' и переменная num с номером символа. Выведите на экран символ, номер которого хранится в переменной num.

let str = 'abcde'
let num = 4;
alert(str[num]);

//task 4
//Задача 4js.Pm.Bs.SCh
// Дана строка. Выведите на экран ее последний символ.

let str = 'catfish';
alert(str[str.length - 1]);

//task 5
// Задача 5js.Pm.Bs.SCh
// Дана строка. Выведите на экран ее предпоследний символ.



//task 6
// Задача 6js.Pm.Bs.SCh
// Дана строка. Выведите на экран ее предпредпоследний символ.

//task 7
// Задача 7js.Pm.Bs.SCh
// Дана строка '12345'. Найдите сумму цифр этой строки.

//task 8
// Задача 8js.Pm.Bs.SCh
// Дано число 12345. Найдите сумму цифр этого числа.

//task 9
// Задача 9js.Pm.Bs.SCh
// Дано число 12345. Найдите произведение цифр этого числа.

//task 10
// Задача 10js.Pm.Bs.SCh
// Дано число 12345. Переставьте цифры этого числа в обратном порядке.
