// http://code.mu/ru/javascript/book/prime/basis/increment-decrement/

// Задача 1
// Переделайте этот код так, чтобы в нем операции инкремента и декремента:
 let num = 10;
 num++;
 num++;
 num--;
 alert(num);//11

// Задачи 2
//Не запуская код, определите, что выведется на экран:
let num = 3;
alert(++num);//4

// Задачи 3
//Не запуская код, определите, что выведется на экран:
let num = 3;
alert(num++);//3

// Задачи 4
//Не запуская код, определите, что выведется на экран:
let num = 3;
alert(--num);//2

// Задачи 5
//Не запуская код, определите, что выведется на экран:
let num = 3;
alert(num--);//3

// Задачи 6
//Не запуская код, определите, что выведется на экран:
let num1 = 3;
let num2 = ++num1;
alert(num1);//4
alert(num2);//4

// Задачи 7
//Не запуская код, определите, что выведется на экран:
let num1 = 3;
let num2 = num1++;
alert(num1);//4
alert(num2);//3

// Задачи 8
//Не запуская код, определите, что выведется на экран:
let num1 = 3;
let num2 = --num1;
alert(num1);//2
alert(num2);//2

// Задачи 9
//Не запуская код, определите, что выведется на экран: 
let num1 = 3;
let num2 = num1--;
alert(num1);2
alert(num2);3
// Задачи 10
// Не запуская код, определите, что выведется на экран:
let num1 = 3;
num1++;
let num2 = num1--;
alert(num1++);4
alert(--num2);4