// http://code.mu/ru/javascript/book/prime/collections/arrays/

// Задача 1
// Создайте массив с элементами 'a', 'b' и 'c'. Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log.

// Задача 2
// Создайте массив с элементами 'a', 'b', 'c'. Выведите на экран каждый из этих элементов.

// Задача 3
// Создайте массив с элементами массив с элементами 'a', 'b', 'c', 'd'. Выведите с его помощью на экран строку 'a+b+c+d'.

// Задача 5
// Создайте массив с элементами 2, 5, 3, 9. Умножьте первый элемент массива на второй, а третий элемент на четвертый. Результаты сложите, присвойте переменной result. Выведите на экран значение этой переменной.

// Задача 7
// Создайте массив с произвольными элементами. Выведите на экран последний элемент этого массива.

// Задача 8
// Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.

// Задача 9
// Создайте массив с числами. Прибавьте к каждому элементу массива число 3. Выведите на экран измененный массив.

// Задача 11
// С помощью описанного приема создайте массив с элементами 1, 2 и 3.

// Задача 12
// Пусть дан такой массив:
// let arr = [1, 2, 3];
// Добавьте ему в конец элементы 4 и 5.

// Задача 13
// Пусть дан такой массив:
// let arr = [];
// arr[3] = 'a';
// arr[8] = 'b';
// Узнайте длину этого массива с помощью свойства length.
