// Задача 1
// Объявите переменную, не задавая ей значения.Выведите значение созданной переменной на экран.

let example1;
alert(example1);
  
// Задача 2
// Присвойте переменной значение null.Выведите эту переменную на экран.

let example2 = null;
alert(example2); 

// Задача 3
// Присвойте переменной значение true.Выведите эту переменную на экран.

let example3 = true;
alert(example3); 

// Задача 4
// Присвойте переменной значение false.Выведите эту переменную на экран.

let example4 = false;
alert(example4); 

// Задача 5
// Сделайте две строки.Перемножьте их друг на друга.Выведите результат умножения на экран.

let a = 'hello';
let b = 'spring';
let c = a * b;
alert(c);

// Задача 6
// Поделите число 10 на 0. Выведите результат на экран.

// let example6 = 10 / 0;
// alert(10 / 0);

alert(10 / 0);

// Задача 7
// Поделите число -10 на 0. Выведите результат на экран.

// let example7 = -10 / 0;
// alert(example7);

alert(-10 / 0);