// Задача 1
// Дана переменная.Выведите в консоль ее значение.
let example1 = 56889;
console.log(example1);

// Задача 2
// Даны три переменные.Выведите в консоль их значения.

let num1 = 954;
let num2 = 90054;
let num3 = 7;
console.log(num1, num2, num3);

// Задача 3
// Выведите в консоль все известные вам типы данных.Посмотрите, чем отличается их цвет.

console.log(8923);
console.log('hello');
console.log([7]);
console.log(Boolean(0));


// Задача 4
// Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется в консоли. Определите, в какой строке кода случилась ошибка.

let example4 = 4352;
console.log(example3);