// Задача 1
// Не запуская код, определите, что выведется на экран:
// let a = '5' + '2';
// alert(a);
'52'

// Задача 2
// Не запуская код, определите, что выведется на экран:
// let a = '5' + 2;
// alert(a);
'52'

// Задача 3
// Не запуская код, определите, что выведется на экран:
// let a = 5 + '2';
// alert(a);
'52'

// Задача 4
// Не запуская код, определите, что выведется на экран:
// let a = 5 + 2;
// alert(a);
7

// Задача 5
// Не запуская код, определите, что выведется на экран:
// let a = '5' * '2';
// alert(a);
10

// Задача 6
// Не запуская код, определите, что выведется на экран:
// let a = '5' - '2';
// alert(a);
3

// Задача 7
// Не запуская код, определите, что выведется на экран:
// let a = '5' / '2';
// alert(a);
2.5

// Задача 8
// Не запуская код, определите, что выведется на экран:
// let a = '5' % '2';
// alert(a);
1

// Задача 9
// Не запуская код, определите, что выведется на экран:
// let a = '5s' * '2';
// alert(a);
NaN

// Задача 10
// Не запуская код, определите, что выведется на экран:
// let a = '5s' + '2';
// alert(a);
'5s2'

// Задача 11
// Не запуская код, определите, что выведется на экран:
// let a = (-'5') + (-'2');
// alert(a);
  - 7

// Задача 12
// Не запуская код, определите, что выведется на экран:
// let a = '5' * 1 + '2' * 1;
// alert(a);
7

// Задача 13
// Не запуская код, определите, что выведется на экран:
// let a = '5' * '1' + '2' * '1';
// alert(a);
7

// Задача 14
// Не запуская код, определите, что выведется на экран:
// let a = '' + 3 + 1;
// alert(a);
'31'