// //https://code.mu/ru/javascript/book/prime/conditions/if-else/#top

// Задача 1
// Если переменная test больше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

const test = 10;

if (test > 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 2
// Если переменная test меньше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

if (test < 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 3
// Если переменная test больше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

if (test >= 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 4
// Если переменная test меньше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

if (test <= 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 5
// Если переменная test равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

if (test = 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 6
// Если переменная test не равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

if (test != 10) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 7
// Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение на экран.

const test1 = 10;
const test2 = 20;

if (test1 < test2) {
    alert('верно');
  } else {
    alert('неверно');
  }