//https://code.mu/ru/javascript/book/prime/conditions/boolean-types/

// Задача 1
// Если переменная test равна true, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

const test = true;

if(test === true) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 2
// Если переменная test равна false, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

const test1 = false;
if(test1 === false) {
  alert('верно');
} else {
  alert('неверно');
}

// Задача 3
// Не запуская код, определите, что выведется на экран:
// let test = 1;	
// if (test == true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно

// Задача 4
// Не запуская код, определите, что выведется на экран:
// let test = 0;
// if (test == true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 5
// Не запуская код, определите, что выведется на экран:
// let test = 1;
// if (test == false) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 6
// Не запуская код, определите, что выведется на экран:
// let test = 1;		
// if (test != true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 7
// Не запуская код, определите, что выведется на экран:
// let test = '';	
// if (test == false) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно

// Задача 8
// Не запуская код, определите, что выведется на экран:
// let test;	
// if (test == true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 9
// Не запуская код, определите, что выведется на экран:
// let test = 3 * 'a';	
// if (test == true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 10
// Перепишите следующий код с использованием сокращенного сравнения:
// let test = true;
// if (test == true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//if (test)

// Задача 11
// Перепишите следующий код с использованием сокращенного сравнения:
// let test = true;
// if (test == false) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//if (!test)

// Задача 12
// Перепишите следующий код с использованием сокращенного сравнения:
// let test = true;
// if (test != true) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//if (!test)

// Задача 13
// Перепишите следующий код с использованием сокращенного сравнения:
// let test = true;
// if (test != false) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }
// Нюанс
// Учтите, что в сокращенных операциях сравнение идет по ==, а не по ===.

//if (test)

// Задача 14
// Не запуская код, определите, что выведется на экран:
// let test = 3;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно

// Задача 15
// Не запуская код, определите, что выведется на экран:
// let test = 'abc';
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно

// Задача 16
// Не запуская код, определите, что выведется на экран:
// let test = '';
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 17
// Не запуская код, определите, что выведется на экран:
// let test = 3 * 'abc';
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 18
// Не запуская код, определите, что выведется на экран:
// let test = null;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 19
// Не запуская код, определите, что выведется на экран:
// let test = false;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 20
// Не запуская код, определите, что выведется на экран:
// let test;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 21
// Не запуская код, определите, что выведется на экран:
// let test = 0;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//неверно

// Задача 22
// Не запуская код, определите, что выведется на экран:
// let test = '0';
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно

// Задача 23
// Не запуская код, определите, что выведется на экран:
// let test = -1;
// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

//верно
