// Задача 1
// Сделайте функцию, которая параметром принимает число и выводит на экран куб этого числа.

// Задача 2
// Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное.В первом случае пусть функция выводит на экран текст '+++', а во втором '---'.

// Задача 3
// Сделайте функцию, которая параметрами принимает 3 числа и выводит на экран сумму этих чисел.

// Задача 4
// Сделайте функцию func, которая параметром будет принимать 3 числа и выводить на экран их сумму. Пусть даны 3 переменные с числами:
// let param1 = 1;
// let param2 = 2;
// let param3 = 3;
// С помощью созданной вами функции выведите на экран сумму значений эти переменных.

// Задача 5

// Дана функция:
// function func(num = 5) {
// 	alert(num * num);
// }
// Эта функция вызывается следующим образом:
// func(2);
// func(3);
// func();
// Расскажите, каким будет результат каждого из вызовов функции.

// Задача 6
// Дана функция:
// function func(num1 = 0, num2 = 0) {
// 	alert(num1 + num2);
// }
// Эта функция вызывается следующим образом:
// func(2, 3);
// func(3);
// func();
// Расскажите, каким будет результат каждого из вызовов функции.