// Задача 1
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	alert(num);
// }
// func();
1

// Задача 2
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	alert(num);
// }
// num = 2;
// func();
2


// Задача 3
// Определите, не запуская код, что выведется на экран:
// function func() {
// 	alert(num);
// }
// let num;
// num = 1;
// func();
// num = 2;
// func();
1
2

// Задача 4
// Определите, не запуская код, что выведется на экран:
// function func() {
// 	let num = 5;
// 	return num;
// }
// alert(num);
//вданном случае будет 2 ошибки не вызвали функцию ,должен быть либо return либо alert и находиться внути тела функии - локальные переменные видны только внутри функции


// Задача 5
// Определите, не запуская код, что выведется на экран:
// function func() {
// 	let num = 5;
// 	return num;
// }
// alert(func());
5 


// Задача 6
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	num = 2;
// }
// func();
// alert(num);
2

// Задача 7
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	let num = 2;
// }
// func();
// alert(num);
1


// Задача 8
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	num = 2;
// }
// func();
// alert(num);
2


// Задача 9
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	num = 2;
// }
// alert(num);
1//поскольку не вызвана функия

// Задача 10
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	let num = 2;
// }
// func();
// alert(num);
1

// Задача 11
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	let num = 2;
// }
// alert(num);
// func();
1

// Задача 12
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	num = 2;
// }
// alert(num);
// func();
1//если бы alert вызывался после func было бы 2


// Задача 1
// Определите, не запуская код, что выведется на экран:
// let num = 1;
// function func() {
// 	num++;
// }
// func();
// func();
// func();
// alert(num);
4

// Задача 14
// Определите, не запуская код, что выведется на экран:
// function func() {
// 	num = 2;
// }
// let num = 1;
// alert(num);
// func();
1// поскольку вначале вызывается alert а затем функция


// Задача 15
// Определите, не запуская код, что выведется на экран:
// function func() {
// 	num = 2;
// }
// let num = 1;
// func();
// alert(num);
2