
// 1. Заполните массив 10-ю иксами с помощью цикла

let example1 = ['x', 'x', 'x', 'x', 'x', 'x', 'x', 'x', 'x', 'x'];
for (i = 0; i < example1.length;  i++) {
  console.log(example1[i]);
}

// 2. Заполните массив числами от 1 до 10 с помощью цикла

let example2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 1; i <= 10; i++) {
  console.log(i);
}

// 3. Дан массив с числами. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.

let example3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 1; i <= 9; i++) {
  console.log(i);
}

// 4. Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5. Как только будет найден первый такой элемент - выведите 'Есть' и оборвите цикл. Если такого элемента нет - ничего не выводите

// 5. Дан массив с числами. С помощью цикла найдите сумму элементов этого массива

// 6. Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива

// 7.Дан массив с числами. Найдите среднее арифметическое его элементов (сумма элементов, делить на количество)